app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums"  ORDER BY "albums"."name" ASC
---
	def index
		@albums = Album.all.order(:name)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 29]]
---
	def new
		@album = Album.new
		@artist = Artist.find(params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 25]]
INSERT INTO "albums" ("name", "year", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Tourist History"], ["year", 2010], ["artist_id", 25], ["created_at", "2015-06-02 00:13:07.755302"], ["updated_at", "2015-06-02 00:13:07.755302"]]
---
	def create
		@artist = Artist.find(params[:artist_id])

		@album = @artist.albums.create(album_params)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 29]]
SELECT  "albums".* FROM "albums" WHERE "albums"."artist_id" = ? AND "albums"."id" = ? LIMIT 1  [["artist_id", 87], ["id", 80]]
---
	def edit
		@artist = Artist.find(params[:artist_id])
		@album = @artist.albums.find(params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 84]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 87]]
---
	def update
		@album = Album.find(params[:id])
		@artist = Artist.find(@album.artist_id)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 11]]
---
    def like
		@album = Album.find(params[:id])