app/controllers/songs_controller.rb

	def index
		@songs = Song.all.order(:name)
---
SELECT "songs".* FROM "songs"  ORDER BY "songs"."name" ASC

	def new
		@song = Song.new
		@album = Album.find(params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", nil]]

	def create
		@album = Album.find(params[:album_id])

		@song = @album.songs.create(song_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 11]]
INSERT INTO "songs" ("name", "time", "album_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Something Good Can Work"], ["time", 300], ["album_id", 11], ["created_at", "2015-06-02 00:14:12.571047"], ["updated_at", "2015-06-02 00:14:12.571047"]]

	def edit
		@album = Album.find(params[:album_id])
		@song = @album.songs.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "songs".* FROM "songs" WHERE "songs"."album_id" = ? AND "songs"."id" = ? LIMIT 1  [["album_id", 85], ["id", 17]]

	def update

		@song = Song.find(params[:id])
		@album = Album.find(@song.album_id)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 17]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 85]]

    def like
		@song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 6]]