app/controllers/welcome_controller.rb

SELECT "artists".* FROM "artists"  ORDER BY "artists"."likes" DESC
SELECT "albums".* FROM "albums"  ORDER BY "albums"."likes" DESC
SELECT "songs".* FROM "songs"  ORDER BY "songs"."likes" DESC
---
	def index
		@artists = Artist.all.order(:likes).reverse_order
		@albums = Album.all.order(:likes).reverse_order
		@songs = Song.all.order(:likes).reverse_order